# Damien's Brewfile

# Brew Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Brew CLI apps
brew "go"
brew "kubernetes-cli"
brew "python@3.8", link: true
brew "mas"
brew "oath-toolkit"
brew "openjdk"
brew "openshift-cli"
brew "podman"
#brew "yadm"  # need to figure out a solution to install without clashing with preinstalled instance

# Brew Font Casks
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

# Brew App Casks
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "prusaslicer"
#cask "setapp"
cask "superduper"
cask "vagrant"
#cask "vagrant-manager"  # not sure I need this
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vnc-viewer"

# Mac App Store Apps
mas "BetterSnapTool", id: 417375580
mas "HotKey", id: 975890633
mas "iMovie", id: 408981434
mas "Save to Pocket", id: 1477385213
#mas "Xcode", id: 497799835  # takes far too long
