brew "kubernetes-cli"
brew "mas"
brew "oath-toolkit"
brew "openjdk"
brew "yadm"
cask "audacity"
cask "discord"
cask "dropbox"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "logi-options+"
cask "minecraft"
cask "monitorcontrol"
cask "obs"
cask "openshift-client"
cask "spotify"
cask "utm"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "HotKey", id: 975890633
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "ad1tyawagh.tango-plus"
vscode "chrislajoie.vscode-modelines"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "platformio.platformio-ide"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-openshift-extension-pack"
vscode "redhat.vscode-openshift-java-pack"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-server-connector"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-maven"
vscode "vscode-arduino.vscode-arduino-community"
vscode "wholroyd.jinja"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
